---
kind: property
id: P:Autodesk.Revit.DB.Structure.LoadCase.Number
source: html/de1beee3-14d9-ae75-5840-579548f9b06e.htm
---
# Autodesk.Revit.DB.Structure.LoadCase.Number Property

Returns unique load case number.

## Syntax (C#)
```csharp
public int Number { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The given number is not unique.